Repository: jenchienchang/asset-flow
Catalog: AssetFlow/Resources/Services.xcstrings
Source language: en
Languages: zh_hant

source: AssetFlow could not open its database due to an incompatible schema. Your data has not been deleted. Please file an issue at the GitHub repository so we can help resolve this. Error: %@
zh_hant: AssetFlow 因資料庫結構不相容而無法開啟。您的資料並未被刪除。 請至 GitHub 儲存庫提交問題回報，我們將協助您解決此問題。 錯誤：%@

source: Backup validation failed: %@
zh_hant: 備份驗證失敗： %@

source: Asset ID '%@' was not found.
zh_hant: 找不到資產 ID「%@」。

source: Category ID '%@' was not found.
zh_hant: 找不到類別 ID「%@」。

source: Duplicate entity ID '%@'.
zh_hant: 實體 ID「%@」重複。

source: Duplicate normalized asset identity.
zh_hant: 正規化後的資產識別重複。

source: Duplicate normalized cash-flow description for this snapshot.
zh_hant: 此快照中正規化後的現金流描述重複。

source: Duplicate normalized category name.
zh_hant: 正規化後的類別名稱重複。

source: Duplicate normalized snapshot date.
zh_hant: 正規化後的快照日期重複。

source: Duplicate settings key '%@'.
zh_hant: 設定鍵「%@」重複。

source: Duplicate snapshot and asset relationship.
zh_hant: 快照與資產的關聯重複。

source: Expected %lld fields but found %lld.
zh_hant: 預期有 %1$lld 個欄位，但實際有 %2$lld 個。

source: Expected 'true' or 'false'.
zh_hant: 預期為「true」或「false」。

source: Expected a decimal from 0 through 100, or an empty value.
zh_hant: 預期為 0 至 100 的十進位數值，或留空。

source: Expected a decimal value.
zh_hant: 預期為十進位數值。

source: Expected a nonnegative integer.
zh_hant: 預期為非負整數。

source: Expected a regular file.
zh_hant: 預期為一般檔案。

source: Expected a UUID.
zh_hant: 預期為 UUID。

source: Expected a valid ISO 8601 timestamp.
zh_hant: 預期為有效的 ISO 8601 時間戳記。

source: Expected an encoded exchange-rate dictionary.
zh_hant: 預期為已編碼的匯率字典。

source: Expected an ISO 8601 date.
zh_hant: 預期為 ISO 8601 日期。

source: Expected UTF-8 encoded text.
zh_hant: 預期為 UTF-8 編碼文字。

source: Expected valid base64 data.
zh_hant: 預期為有效的 Base64 資料。

source: Failed to create ZIP: %@
zh_hant: 建立 ZIP 失敗：%@

source: Invalid manifest.json: %@
zh_hant: manifest.json 無效：%@

source: Missing required settings key '%@'.
zh_hant: 缺少必要的設定鍵「%@」。

source: Only one exchange-rate record is allowed per snapshot.
zh_hant: 每個快照只允許一筆匯率記錄。

source: Rates must be a nonempty dictionary of positive finite values.
zh_hant: 匯率必須是包含正有限數值的非空字典。

source: Snapshot ID '%@' was not found.
zh_hant: 找不到快照 ID「%@」。

source: The app version must not be empty.
zh_hant: App 版本不得為空。

source: The base currency must not be empty.
zh_hant: 基準貨幣不得為空。

source: The description must not be empty.
zh_hant: 描述不得為空。

source: The display currency must not be empty.
zh_hant: 顯示貨幣不得為空。

source: The file exceeds the supported size limit.
zh_hant: 檔案超過支援的大小上限。

source: The name must not be empty.
zh_hant: 名稱不得為空。

source: This file is not supported by backup format version %lld.
zh_hant: 備份格式版本 %lld 不支援此檔案。

source: Unexpected character after a closing quote.
zh_hant: 結束引號後出現非預期字元。

source: Unexpected quote in an unquoted field.
zh_hant: 未加引號的欄位中出現非預期引號。

source: Unknown date format '%@'.
zh_hant: 未知的日期格式「%@」。

source: Unknown ditto error
zh_hant: 未知的 ditto 錯誤

source: Unknown settings key '%@'.
zh_hant: 未知的設定鍵「%@」。

source: Unterminated quoted field.
zh_hant: 加引號的欄位未正確結束。

source: Validated asset ID was not available during value insertion.
zh_hant: 插入數值時找不到已驗證的資產 ID。

source: Validated category ID was not available during insertion.
zh_hant: 插入時找不到已驗證的類別 ID。

source: Validated snapshot ID was not available during cash-flow insertion.
zh_hant: 插入現金流時找不到已驗證的快照 ID。

source: Validated snapshot ID was not available during exchange-rate insertion.
zh_hant: 插入匯率時找不到已驗證的快照 ID。

source: Validated snapshot ID was not available during value insertion.
zh_hant: 插入數值時找不到已驗證的快照 ID。

source: Corrupted data: %@
zh_hant: 資料損毀：%@

source: Exchange rates not found for the requested date.
zh_hant: 找不到該日期的匯率資料。

source: Not available due to missing exchange rates: %@.
zh_hant: 因缺少匯率而無法使用：%@。

# Invalid headers in %@. Expected: %@. Got: %@.
source: Invalid headers in %1$@. Expected: %2$@. Got: %3$@.
zh_hant: %1$@ 中的標題無效。預期：%2$@。實際：%3$@。

# Invalid reference in %@: %@ '%@' not found.
source: Invalid reference in %1$@: %2$@ '%3$@' not found.
zh_hant: %1$@ 中的參照無效：找不到 %2$@「%3$@」。

source: Invalid response from exchange rate service.
zh_hant: 匯率服務的回應無效。

source: Missing required file: %@
zh_hant: 缺少必要檔案：%@

source: Network unavailable. Exchange rates could not be fetched.
zh_hant: 網路無法使用，無法取得匯率資料。

source: Affected snapshots: %@.
zh_hant: 受影響的快照：%@。

source: Some exchange rates are unavailable.
zh_hant: 部分匯率無法使用。

source: Open GitHub Issues
zh_hant: 開啟 GitHub Issues

source: Quit
zh_hant: 結束

source: The file is not a valid backup archive.
zh_hant: 此檔案不是有效的備份封存檔。

source: The backup could not be restored: %@
zh_hant: 無法還原備份：%@

source: Unable to Open Database
zh_hant: 無法開啟資料庫

source: Unsupported backup format version: %lld.
zh_hant: 不支援的備份格式版本：%lld。
